#+begin_src sqlite :db ./clownpress.db
  DELETE FROM processed_content;
  DELETE FROM provided_content;
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./clownpress.db
  SELECT
    (json_extract(prov.metadata, "$.slug")) AS slug,
    (json_extract(prov.metadata, "$.tags")) AS tags,
    (json_extract(prov.metadata, "$.category")) AS category,
    (json_extract(prov.metadata, "$.date")) AS published_at
  FROM provided_content AS prov
  LEFT JOIN processed_content AS proc
    ON (prov.id = proc.prov_cont_id)
  WHERE (("html" = proc.type)
    AND ((tags IS NULL) OR (NOT (tags LIKE "%draft%"))))
    AND slug LIKE "%relationship%"
  ORDER BY published_at
  DESC LIMIT 5;
#+end_src

#+RESULTS:
| relationships | ["life"] | blog | 2018-11-10 00:00:00 |

#+begin_src sqlite :db ./clownpress.db
  SELECT
    (json_extract(prov.metadata, "$.title")) AS title,
    metadata as meta,
    (json_extract(prov.metadata, "$.tags")) AS tags,
    (json_extract(prov.metadata, "$.category")) AS category
  FROM provided_content AS prov
    LEFT JOIN processed_content AS proc
    ON (prov.id = proc.prov_cont_id)
  WHERE (
    prov.provider = "projects"
  )
#+end_src

#+RESULTS:
| cl-ownpress       | {"date":"2022-10-11 14:47:19","title":"cl-ownpress","url":"https://github.com/bitspook/cl-ownpress","languages":"Shell, Common Lisp, Nix, Emacs Lisp,","created_at":"2022-05-11T09:32:16Z","pushed_at":"2022-09-26T11:06:17Z","is_fork":"NIL","stars":"2","category":null,"slug":"cl-ownpress"} |               |   |
| danklang          | {"date":"2022-10-11 14:47:19","title":"danklang","url":"https://github.com/bitspook/danklang","languages":"Shell, Nix, Rust,","created_at":"2021-11-09T02:39:15Z","pushed_at":"2021-11-09T11:07:58Z","is_fork":"NIL","stars":"0","category":null,"slug":"danklang"} |               |   |
| entropy           | {"date":"2022-10-11 14:47:19","title":"entropy","url":"https://github.com/bitspook/entropy","languages":"Shell, Nix, Rust, SCSS, PLpgSQL,","created_at":"2021-06-06T04:14:28Z","pushed_at":"2022-09-15T19:01:11Z","is_fork":"NIL","stars":"4","category":null,"slug":"entropy"} |               |   |
| freedombox        | {"date":"2022-10-11 14:47:20","title":"freedombox","url":"https://github.com/bitspook/freedombox","languages":"Nix, Haskell, Shell, CSS,","created_at":"2020-11-16T05:47:14Z","pushed_at":"2022-09-21T11:06:32Z","is_fork":"NIL","stars":"1","category":null,"slug":"freedombox"} |               |   |
| humans-of-trantor | {"date":"2022-10-11 14:47:20","title":"humans-of-trantor","url":"https://github.com/bitspook/humans-of-trantor","languages":"Jinja, JavaScript, TypeScript, EJS, Dockerfile, Shell, HTML, SCSS, Haskell, Dhall, PLpgSQL,","created_at":"2022-09-26T11:38:56Z","pushed_at":"2022-09-26T11:54:46Z","is_fork":"NIL","stars":"0","category":null,"slug":"humans-of-trantor"} |               |   |
| saunf             | {"date":"2022-10-11 14:47:20","title":"saunf","url":"https://github.com/bitspook/saunf","languages":"Shell, Haskell, Nix, Dhall, Emacs Lisp,","created_at":"2021-01-31T02:32:25Z","pushed_at":"2022-03-03T02:52:17Z","is_fork":"NIL","stars":"2","tags":["published"],"category":null,"slug":"saunf"} | ["published"] |   |
| sos-app           | {"date":"2022-10-11 14:47:20","title":"sos-app","url":"https://github.com/sosinc/sos-app","languages":"PLpgSQL, JavaScript, Dockerfile, TypeScript, Emacs Lisp, SCSS,","created_at":"2020-04-27T06:33:16Z","pushed_at":"2022-01-15T04:20:14Z","is_fork":"NIL","stars":"3","category":null,"slug":"sos-app"} |               |   |
| spookfox          | {"date":"2022-10-11 14:47:20","title":"spookfox","url":"https://github.com/bitspook/spookfox","languages":"Shell, Nix, JavaScript, Rust, Emacs Lisp, TypeScript, Makefile,","created_at":"2022-02-21T17:40:34Z","pushed_at":"2022-04-27T09:17:27Z","is_fork":"NIL","stars":"46","category":null,"slug":"spookfox"} |               |   |

#+begin_src sqlite :db ./clownpress.db
    DELETE FROM provided_content WHERE (json_extract(metadata, "$.category")) IS NULL;
#+end_src

#+RESULTS:
